-- phpMyAdmin SQL Dump
-- version 4.7.4
-- https://www.phpmyadmin.net/
--
-- Хост: 127.0.0.1
-- Время создания: Апр 29 2021 г., 12:29
-- Версия сервера: 10.1.30-MariaDB
-- Версия PHP: 7.2.1

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `life2`
--

-- --------------------------------------------------------

--
-- Структура таблицы `menus`
--

CREATE TABLE `menus` (
  `id` bigint(20) UNSIGNED NOT NULL,
  `orderid` int(11) NOT NULL DEFAULT '0',
  `level` int(11) NOT NULL DEFAULT '0',
  `subs` int(11) NOT NULL DEFAULT '0',
  `goods` int(11) NOT NULL DEFAULT '0',
  `name_ru` varchar(250) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name_kz` varchar(250) COLLATE utf8mb4_unicode_ci NOT NULL,
  `name_en` varchar(250) COLLATE utf8mb4_unicode_ci NOT NULL,
  `link` varchar(250) COLLATE utf8mb4_unicode_ci NOT NULL,
  `getlast` set('y','n') COLLATE utf8mb4_unicode_ci NOT NULL DEFAULT 'n',
  `depth` int(11) NOT NULL DEFAULT '0',
  `user` int(11) NOT NULL DEFAULT '1'
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_unicode_ci;

--
-- Дамп данных таблицы `menus`
--

INSERT INTO `menus` (`id`, `orderid`, `level`, `subs`, `goods`, `name_ru`, `name_kz`, `name_en`, `link`, `getlast`, `depth`, `user`) VALUES
(1, 1, 0, 0, 0, 'Статьи', '', '', 'arts', 'n', 0, 1),
(2, 2, 1, 0, 0, 'Главная', '', 'Main', 'link2', 'n', 1, 1),
(3, 3, 2, 0, 0, 'Страховые продукты', '', '', 'link3', 'n', 2, 1),
(4, 4, 2, 0, 0, 'Компания', '', '', 'link4', 'n', 2, 1),
(5, 5, 3, 0, 0, 'ОС НСР', 'ҚЖОМС', '', 'link5', 'n', 3, 1),
(6, 6, 3, 0, 0, 'Аннуитетное страхование', '', '', 'link6', 'n', 3, 1),
(7, 7, 3, 0, 0, 'Страхование жизни', '', '', 'link7', 'n', 3, 1),
(8, 8, 5, 0, 0, 'Часто задаваемые вопросы', 'Жиі қойылатын сұрақтар', '', 'link8', 'n', 4, 1),
(9, 9, 4, 0, 0, 'О компании', '', '', 'link9', 'n', 3, 1),
(10, 10, 4, 0, 0, 'Пресс-центр', '', '', 'link10', 'n', 3, 1),
(11, 11, 4, 0, 0, 'Контакты', '', '', 'link11', 'n', 3, 1),
(12, 12, 9, 0, 0, 'История', '', '', 'link12', 'n', 4, 1),
(13, 13, 9, 0, 0, 'Команда', '', '', 'link13', 'n', 4, 1),
(14, 14, 9, 0, 0, 'Лицензия', '', '', 'link14', 'n', 4, 1),
(15, 15, 9, 0, 0, 'Финансовая отчетность', '', '', 'link15', 'n', 4, 1),
(16, 16, 9, 0, 0, 'Акционерам', '', '', 'link16', 'n', 4, 1),
(17, 17, 9, 0, 0, 'Корпоративные события', '', '', 'link17', 'n', 4, 1),
(18, 18, 9, 0, 0, 'Комплаенс-контролер', '', '', 'link18', 'n', 4, 1),
(19, 19, 9, 0, 0, 'Инсайдерам', '', '', 'link19', 'n', 4, 1),
(20, 20, 9, 0, 0, 'Правила и тарифы', '', '', 'link20', 'n', 4, 1),
(21, 21, 9, 0, 0, 'Реквизиты', '', '', 'link21', 'n', 4, 1),
(22, 22, 10, 0, 0, 'Новости', '', '', 'link22', 'n', 4, 1),
(23, 23, 22, 0, 0, '2019', '', '', 'link23', 'n', 5, 1),
(24, 24, 11, 0, 0, 'Центральный офис', '', '', 'link24', 'n', 4, 1),
(25, 25, 11, 0, 0, 'Меню филиала', 'Меню филиала', 'Меню филиала', 'link25', 'n', 4, 1),
(26, 26, 11, 0, 0, 'Контакты для сми', '', '', 'link26', 'n', 4, 1),
(29, 29, 13, 0, 0, 'Совет директоров', 'Директорлар кеңесі', '', 'link29', 'n', 5, 1),
(30, 30, 13, 0, 0, 'Правление', '', '', 'link30', 'n', 5, 1),
(31, 31, 13, 0, 0, 'Иные руководящие работники', '', '', 'link31', 'n', 5, 1),
(32, 32, 22, 0, 0, '2020', '', '', 'link32', 'n', 5, 1),
(33, 68, 12, 0, 0, '2019', '', '', 'link33', 'n', 5, 1),
(34, 34, 14, 0, 0, 'content', '', '', 'link34', 'n', 5, 1),
(35, 35, 24, 0, 0, 'Алматы', 'Алматы', 'Almaty', 'link35', 'n', 5, 1),
(36, 36, 24, 0, 0, 'Актау', 'Ақтау', 'Aktau', 'link36', 'n', 5, 1),
(37, 37, 24, 0, 0, 'Актобе', 'Ақтөбе', 'Aktobe', 'link37', 'n', 5, 1),
(39, 39, 24, 0, 0, 'Атырау', 'Атырау', 'Atyrau', 'link39', 'n', 5, 1),
(40, 40, 24, 0, 0, 'Караганда', 'Қарағанды', 'Karaganda', 'link40', 'n', 5, 1),
(41, 41, 24, 0, 0, 'Кокшетау', 'Көкшетау', 'Kokshetau', 'link41', 'n', 5, 1),
(42, 42, 24, 0, 0, 'Костанай', 'Қостанай', 'Kostanay', 'link42', 'n', 5, 1),
(43, 43, 24, 0, 0, 'Кызылорда', 'Қызылорда', 'Kyzylorda', 'link43', 'n', 5, 1),
(44, 44, 24, 0, 0, 'Нур-Султан', 'Нұр-Сұлтан', 'Nur-Sultan', 'link44', 'n', 5, 1),
(45, 45, 24, 0, 0, 'Павлодар', 'Павлодар', 'Pavlodar', 'link45', 'n', 5, 1),
(46, 46, 24, 0, 0, 'Петропавловск', 'Петропавл', 'Petropavlosk', 'link46', 'n', 5, 1),
(47, 47, 24, 0, 0, 'Семей', 'Семей', 'Semey', 'link47', 'n', 5, 1),
(48, 48, 24, 0, 0, 'Талдыкорган', 'Талдықорған', 'Taldykorgan', 'link48', 'n', 5, 1),
(49, 49, 24, 0, 0, 'Тараз', 'Тараз', 'Taraz', 'link49', 'n', 5, 1),
(50, 50, 24, 0, 0, 'Туркестан', 'Түркістан', 'Turkestan', 'link50', 'n', 5, 1),
(51, 51, 24, 0, 0, 'Уральск', 'Орал', '', 'link51', 'n', 5, 1),
(52, 52, 24, 0, 0, 'Усть-Каменогорск', 'Өскемен', '', 'link52', 'n', 5, 1),
(53, 53, 24, 0, 0, 'Шымкент', 'Шымкент', 'Shymkent', 'link53', 'n', 5, 1),
(55, 55, 6, 0, 0, 'Часто задаваемые вопросы', '', '', 'link55', 'n', 4, 1),
(56, 56, 7, 0, 0, 'Часто задаваемые вопросы', '', 'FAQ', 'link56', 'n', 4, 1),
(61, 61, 5, 0, 0, 'OC TEXT BLOCK', 'OC TEXT BLOCK', 'OC TEXT BLOCK', 'link61', 'n', 4, 1),
(62, 62, 6, 0, 0, 'Текстовой блок', 'Текстовой блок', '', 'link62', 'n', 4, 1),
(63, 63, 7, 0, 0, 'Текстовой блок', 'Текстовой блок', '', 'link63', 'n', 4, 1),
(64, 64, 3, 0, 0, 'Пенсионное страхование', 'Пенсионное страхование', 'PI', 'link64', 'n', 3, 1),
(65, 65, 64, 0, 0, 'ЧАВО (ПС)', 'ЧАВО (ПС)', 'ЧАВО (ПС)', 'link65', 'n', 4, 1),
(66, 66, 64, 0, 0, 'Текстовой блок (ПС)', 'Текстовой блок (ПС)', 'Текстовой блок (ПС)', 'link66', 'n', 4, 1),
(67, 67, 12, 0, 0, '2020', '2020', '', 'link67', 'n', 5, 1),
(68, 68, 9, 0, 0, 'Реестр агентов', 'Реестр агентов', '', 'link68', 'n', 4, 1),
(69, 69, 9, 0, 0, 'Участие в ассоциациях', 'Участие в ассоциациях', '', 'link69', 'n', 4, 1),
(75, 75, 22, 0, 0, '2021', '2021', '2021', 'link75', 'n', 5, 1),
(77, 77, 4, 0, 0, 'Информационная безопасность', '', '', 'link77', 'n', 3, 1),
(78, 78, 3, 0, 0, 'Группа продуктов', '', '', 'link78', 'n', 3, 1);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `menus`
--
ALTER TABLE `menus`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `menus`
--
ALTER TABLE `menus`
  MODIFY `id` bigint(20) UNSIGNED NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=79;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
